tutorials/incompressible/pimpleDyMFoam/axialTurbine/0_orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    GVINLET
    {
        type            calculated;
        value           uniform 0;
    }
    GVOUTLET
    {
        type            overlapGgi;
        value           uniform 0;
    }
    GVCYCLIC1
    {
        type            cyclicGgi;
        value           uniform 0;
    }
    GVCYCLIC2
    {
        type            cyclicGgi;
        value           uniform 0;
    }
    GVBLADE
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    GVHUB
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    GVSHROUD
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    RUINLET
    {
        type            overlapGgi;
        value           uniform 0;
    }
    RUOUTLET
    {
        type            overlapGgi;
        value           uniform 0;
    }
    RUCYCLIC1
    {
        type            cyclicGgi;
        value           uniform 0;
    }
    RUCYCLIC2
    {
        type            cyclicGgi;
        value           uniform 0;
    }
    RUBLADE
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    RUHUB
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    RUSHROUD
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    DTINLET
    {
        type            overlapGgi;
        value           uniform 0;
    }
    DTOUTLET
    {
        type            calculated;
        value           uniform 0;
    }
    DTCYCLIC1
    {
        type            cyclicGgi;
        value           uniform 0;
    }
    DTCYCLIC2
    {
        type            cyclicGgi;
        value           uniform 0;
    }
    DTHUB
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    DTSHROUD
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
}


// ************************************************************************* //
